In [2]:
import numpy as np
import pandas as pd

In [22]:
arr1 = np.random.randint(0,100,(3,4))
df1 = pd.DataFrame(arr1, columns=["a","b","c","d"])
arr2 = np.random.randint(0,100,(3,4))
df2 = pd.DataFrame(arr2, columns=["e","f","g","h"])

In [23]:
df1

    a   b   c   d
0  77  32  46  43
1  31  83  91  98
2  87  95  88  94

In [24]:
df2

    e   f   g   h
0  11  44  95  71
1  73  10   6  41
2  34  56  15  14

In [27]:
pd.concat([df1,df2])

      a     b     c     d     e     f     g     h
0  77.0  32.0  46.0  43.0   NaN   NaN   NaN   NaN
1  31.0  83.0  91.0  98.0   NaN   NaN   NaN   NaN
2  87.0  95.0  88.0  94.0   NaN   NaN   NaN   NaN
0   NaN   NaN   NaN   NaN  11.0  44.0  95.0  71.0
1   NaN   NaN   NaN   NaN  73.0  10.0   6.0  41.0
2   NaN   NaN   NaN   NaN  34.0  56.0  15.0  14.0

In [26]:
pd.concat([df1,df2], ignore_index=True)

      a     b     c     d     e     f     g     h
0  77.0  32.0  46.0  43.0   NaN   NaN   NaN   NaN
1  31.0  83.0  91.0  98.0   NaN   NaN   NaN   NaN
2  87.0  95.0  88.0  94.0   NaN   NaN   NaN   NaN
3   NaN   NaN   NaN   NaN  11.0  44.0  95.0  71.0
4   NaN   NaN   NaN   NaN  73.0  10.0   6.0  41.0
5   NaN   NaN   NaN   NaN  34.0  56.0  15.0  14.0

In [10]:
pd.concat([df1,df2],axis=1)

    a   b   c   d   e   f   g   h
0  79  49  30   1  94  14  31  29
1  41  60  81   4  60  45  77  54
2  82  67  47  96   4  80  67  22

In [25]:
df1.append(df2)

AttributeError: 'DataFrame' object has no attribute 'append'

In [28]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [29]:
df1

              a         b
0  {'x': 'foo'}  {'x': 1}
1  {'y': 'bar'}  {'y': 2}

In [30]:
df2

              a         c
0  {'x': 'foo'}  {'x': 3}
1  {'y': 'baz'}  {'y': 4}

In [21]:
df1.merge(df2)

     a  b  c
0  foo  1  3